package org.example;

// Press Shift twice to open the Search Everywhere dialog and type `show whitespaces`,
// then press Enter. You can now see whitespace characters in your code.
public class Main {
    public static void main(String[] args) {
        // 1) Почему использование тестовых заглушек может быть полезным при написании модульных тестов?
        // Потому что не всегда отдельные модули могут быть готовы, а без них проверка одного может быть невозможна.

        // 2) Какой тип тестовой заглушки следует использовать, если вам нужно проверить, что метод был вызван с определенными аргументами?
        // Для этого используется заглушка типа moki.

        // 3) Какой тип тестовой заглушки следует использовать, если вам просто нужно вернуть определенное значение или исключение в ответ на вызов метода?
        // Для получения заготовленного ответа используется stub.

        // 4) Какой тип тестовой заглушки вы бы использовали для имитации взаимодействия с внешним API или базой данных?
        // Для этого так-же используется stub-заглушка.

    }
}